Revit 2026 API

# TriangulationInterfaceForTriangulatedSolidOrShell Properties

---

The TriangulationInterfaceForTriangulatedSolidOrShell type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from TriangulationInterface) |

#### Reference

TriangulationInterfaceForTriangulatedSolidOrShell Class

Autodesk.Revit.DB Namespace